In [11]:
import pandas as pd

In [12]:
pd.Series?

In [13]:
animals = ['Tiger','Bear','Moose']

In [14]:
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [15]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [16]:
animals = ['Tiger','Bear',None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [17]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [19]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [20]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [21]:
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [22]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [23]:
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [25]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [26]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [27]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [30]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [31]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [32]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [33]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [34]:
copy_df.drop?

In [35]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

In [37]:
df.loc[:,['Cost']*.8]

TypeError: can't multiply sequence by non-int of type 'float'

In [38]:
df['Discount'] = df['Cost']*.8

In [39]:
df

          Name Item Purchased  Cost Location  Discount
Store 1  Chris       Dog Food  22.5     None      18.0
Store 1  Kevyn   Kitty Litter   2.5     None       2.0
Store 2  Vinod      Bird Seed   5.0     None       4.0

In [40]:
df['Cost'] *= 0.8
print(df)

          Name Item Purchased  Cost Location  Discount
Store 1  Chris       Dog Food  18.0     None      18.0
Store 1  Kevyn   Kitty Litter   2.0     None       2.0
Store 2  Vinod      Bird Seed   4.0     None       4.0

In [41]:
costs = df['Cost']
costs

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [42]:
costs +=2
costs

Store 1    20.0
Store 1     4.0
Store 2     6.0
Name: Cost, dtype: float64

In [43]:
df

          Name Item Purchased  Cost Location  Discount
Store 1  Chris       Dog Food  20.0     None      18.0
Store 1  Kevyn   Kitty Litter   4.0     None       2.0
Store 2  Vinod      Bird Seed   6.0     None       4.0

In [45]:
!cat olympics.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [46]:
!cat olympics.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [48]:
df = pd.read_csv('C:\Users\dfitzgerald\Documents\My Courses\Intro to Data Science in Python\course downloads\olympics.csv')
df.head()

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-48-4f246bd98a71>, line 1)